<%@ taglib prefix="c" uri="http://java.sun.com/jsp/jstl/core" %>
<%@ page contentType="text/html;charset=UTF-8" %>
<div class="container col-sm col-md-10 col-lg-8 col-xl-6">
    <h1 class="font-weight-bold">Cloudev 웹 사이트 이용약관</h1><br><br>

    <p>
        <b>제 1장 총칙</b><br><br>
    제 1조 (목적)<br>
    ① 본 약관은 Cloudev 웹 사이트(이하 ‘Cloudev’)가 제공하는 규정된 서비스(이하 ‘서비스’)의 이용조건, 사용자와 Cloudev가 가져야할 권리, 의무, 책임사항 및 기타 필요한 사항을 규정함을 목적으로 합니다.<br>
    ② 본 약관 외에도 Github API를 기반으로 Github의 규정된 서비스(이하 ‘Github 서비스‘)도 제공하기 때문에 Github의 이용약관도 포함 됩니다.<br>
    ③ Github의 이용약관으로는 (1).Terms of Service(서비스 약관)(2).Privacy Statement(개인정보 보호 정책)(3).Global Privacy Practices(글로벌 개인 정보 보호 관행)(4).DMCA Takedown Policy(DMCA 게시 중단 정책) (5).Guidelines for Legal Requests of User Data(사용자 데이터의 법적 요청 지침)(6).Github Acceptable Use Policies(Github 서비스 이용 정책) 등이 약관이 함께 적용됩니다.<br><br>

    제 2조 (용어의 정의)<br>
    본 약관에서 사용하는 용어는 다음과 같이 정의한다.<br>
    ① 사용자 : 본 약관에 따라 Cloudev의 이용절차에 동의하고 제공하는 서비스와 Github 약관에 따라 제공되는 Github 서비스를 회원 가입하여 액세스 토큰을 발급받아 로그인하여 이용하는 자<br>
    ② 액세스 토큰 : Github 계정을 가진 자가 본 서비스를 이용하기 위해 Github에서 발급받는 액세스  토큰<br><br>

    제 3조 (약관의 공시 및 효력과 변경)<br>
    ① 본 약관은 로그인 화면이나 로그인 후 메인 페이지 아래쪽에 게시하며 본 약관이나 Github의 약관이 중요한 사유에 의해 변경될 수 있으며 변경된 약관은 사용자에게 공시한다.<br>
    ② 본 약관 및 차후 사정에 따라 변경된 약관은 사용자에게 공시함으로써 효력을 발생한다.<br><br>

    제 4조 (약관 외 준칙)<br>
    ① 본 약관에 명시되지 않은 사항이 전기통신기본법, 전기통신사업법, 정보통신 촉진법, ‘전자상거래 등에서의 소비자 보호에 관한 법률’, ‘약관의 규제에 관한 법률’, ‘전자거래기본법’, ‘전자서명법’, ‘정보통신망 이용촉진 등에 관한 법률’, ‘소비자보호법’ 등 기타 관계 법령에 규정되어 있을 경우에는 그 규정을 따르도록 한다.<br><br>
    </p>
<p>
    <b>제 2장 이용계약</b><br><br>
    제 5조 (이용방법)<br>
    ① 사용자는 Github 웹 사이트에서 Github 회원가입 안내대로 회원가입을 하고 액세스 토큰을 발급<br>
    ② 사용자는 발급받은 액세스 토큰을 로그인 화면 페이지에서 입력하여 로그인하고 서비스 사용이 가능하다.<br><br>

    제 6조 (이용방법이 불가능한 경우)<br>
    ① 본 사이트는 제 5조에 따른 방법으로 시도를 하였음에도 이용이 불가능한 경우는 제 2항의 경우를 예외로 하여 서비스 이용을 할 수 있다.<br>
    ② Cloudev는 아래 사항에 해당하는 경우에는 그 제한 사유가 해소될 때까지 서비스 이용이 불가능   하다.(1).Github의 약관에 위배되는 행위를 하여 계정이 정지되는 경우(2).Github API 통신 장애 문제로 인해 발급받은 액세스 토큰을 사용해도 불가능한 경우<br><br>
</p>
    <p>
        <b>제 3장 사용자와 Cloudev의 의무</b><br><br>
    제 7조 (Cloudev의 의무)<br>
    ① Cloudev는 Github API 서비스를 중단하기 전까지는 사이트를 안정적이고 지속적으로 운영할 의무가 있다.<br>
    ② Cloudev는 제 1항의 경우 수사상의 목적으로 관계기관 및 정보통신윤리위원회의 요청이 있거나 영장 제시가 있는 경우. 기타 관계 법령에 의한 경우는 예외로 한다.<br>
    ③ Cloudev는 Github API로 Github 서비스를 사용함에 있어 약관이 변경될 경우엔 사용자에게 이를 공시한다.<br><br>

    제 8조 (사용자의 의무)<br>
    ① 사용자는 본 약관 및 Github 서비스를 이용하기 위한 약관 및 이용안내 등을ㄹ 숙지하고 준수해야 하며 기타 Cloudev의 업무에 방해되는 행위를 해서는 안된다.<br>
    ② 사용자는 Cloudev나 Github의 약관에 어긋나거나 사전 승인 없이 Cloudev나 Github를 이용하여 어떠한 영리행위도 할 수 없다.<br>
    ③ 사용자는 Cloudev를 이용하기 위해 다른 사용자의 Github 계정이나 액세스 토큰을 사용할 수 없다.<br><br>
    </p>

    <p>
        <b>제 4장 서비스의 제공 및 이용</b><br><br>
    제 9조<br>
    ① 사용자는 본 약관과 제 1조 2항 및 3항의 규정된 사항을 준수해 사이트를 이용한다.<br>
    ② 본 약관 및 제 1조 2항 및 3항에 명시되지 않은 서비스 이용에 관한 사항은 사용자에게 공시한다.<br><br>

    제 10조 (서비스 이용의 제한)<br>
    본 사이트 이용 및 행위가 다음 각 항에 해당하는 경우 사용자는 Cloudev의 이용이 제한될 수 있다.<br>
    ① 제 1조 3항의 각 호에 해당하는 약관을 위배 하여 Github 계정이 정지되거나 무효화 되어 액세스 토큰을 발급받지 못하는 경우<br>
    ② 디지털 밀레니엄 저작권법(이하 ‘DMCA’)에 어긋나는 경우가 있을 경우<br>
    ③ 다른 이용자 또는 제3자의 지적재산권을 침해하거나 지적재산권자가 지적 재산권의 침해를 주장할 수 있다고 판단되는 경우<br>
    ④ 해킹 및 컴퓨터 바이러스 유포 등으로 서비스의 건전한 운영을 저해하는 경우<br>
    ⑤ 타인의 아이디 및 비밀번호를 도용한 경우<br>
    ⑥ 기타 관계 법령에 위배되는 경우 및 회사가 이용자로서 부적당하다고 판단한 경우<br><br>

    제 11조 (서비스 제공의 중지)<br>
    Cloudev는 다음 각 호에 해당하는 경우 서비스의 전부 또는 일부의 제공을 중지할 수 있다.<br>
    ① 전기통신사업법 상에 규정된 기간통신 사업자 또는 인터넷 망 사업자가 서비스를 중지했을 경우<br>
    ② 정전으로 서비스 제공이 불가능할 경우<br>
    ③ 설비의 이전, 보수 또는 공사로 인해 부득이한 경우<br>
    ④ 서비스 설비의 장애 또는 서비스 이용의 폭주 등으로 정상적인 서비스 제공이 어려운 경우<br>
    ⑤ 전시, 사변, 천재지변 또는 이에 준하는 국가비상사태가 발생하거나 발생할 우려가 있는 경우<br>
    ⑥ Github의 API 서비스 이용이 중지되거나 Github 서비스가 종료된 경우<br><br>

    제 12조 (서비스 이용 책임)<br>
    사용자는 Cloudev, Github의 서비스를 이용하여 불법상품을 판매하는 영업활동을 할 수 없으며 특히 해킹, 돈 벌기 광고, 음란 사이트를 통한 상업행위, 상용 S/W 불법제공 등을 할 수 없다. 이를 어기고 발생한 영업활동의 결과 및 손실, 관계기관에 의한 구속 등 법적 조치 등에 관해서는 Cloudev가 책임을 지지 않는다.<br><br>
    </p>

    <p>
        <b>제 5장 기타</b><br><br>
    제 13조 (면책 및 손해배상)<br>
    ① 천재지변 또는 이에 준하는 불가항역으로 인하여 서비스를 제공할 수 없는 경우에는 Cloudev의 서비스 제공 책임이 면제 된다.<br>
    ② Cloudev는 사용자간 또는 사용자와 제 3자간의 상호 거래 관계에서 발생되는 ruff과에 대하여 어떠한 책임도 부담하지 않는다.<br>
    ③ Cloudev는 사용자가 사용하는 정보, 자료, 내용 등에 관하여 사실의 정확성, 신뢰도 등에 어떠한   책임도 부담하지 않으며 사용자는 본인의 책임 아래 본 사이트를 이용해야 한다.<br>
    ④ 사용자가 사용하거나 전송한 자료 등에 관하여 손해가 발생하거나 자료의 취사선택, 기타 무료로   제공되는 서비스 이용과 간련해 어떠한 불이익이 발생하더라도 이에 대한 모든 책임은 사용자에게  있다.<br>
    ⑤ 사용자가 사용하는 Github 계정의 아이디와 비밀번호 및 액세스 토큰의 관리 부주의로 인하여 발생되는 손해 또는 제 3자에 의한 부정사용 등에 대한 책임은 사용자에게 있다.<br>
    ⑥ 사용자가 본 약관의 규정을 위반하거나 제 1조 3항의 각 호에 해당하는 규정을 위반하여 Cloudev에 손해가 발생하는 경우에는 사용자가 손해를 배상해야 하며 손해로부터 Cloudev 회사를 면책시킨다.<br><br>

    제 14조 (분쟁의 해결)<br>
    ① Cloudev와 사용자는 본 사이트 및 Github 서비스 이용에 관련해 발생한 분쟁을 원만하게 해결하기 위하여 필요한 모든 노력을 해야 한다.<br>
    ② 제 1항의 규정에도 불구하고 분쟁으로 인하여 소송이 제기될 경우 소송은 Cloudev의 소재지를 관할하는 법원의 관할로 본다.<br><br>
    </p>

    <br>
        본 약관은 2020년 12월 1일부터 적용한다.
</div>